# Lecture 4 â€“Fall 2023

A demonstration of advanced `pandas` syntax to accompany Lecture 4.

In [ ]:
#from google.colab import drive
#drive.mount('/content/drive')

In [7]:
import numpy as np
import pandas as pd
import plotly.express as px

## Dataset: California baby names

In today's lecture, we'll work with the `babynames` dataset, which contains information about the names of infants born in California.

The cell below pulls census data from a government website and then loads it into a usable form. The code shown here is outside of the scope of Data 100, but you're encouraged to dig into it if you are interested!

In [8]:
import urllib.request
import os.path
import zipfile

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # If the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

ca_name = 'STATE.CA.TXT'
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']
with zf.open(ca_name) as fh:
    babynames = pd.read_csv(fh, header=None, names=field_names)

babynames.head()

  State Sex  Year      Name  Count
0    CA   F  1910      Mary    295
1    CA   F  1910     Helen    239
2    CA   F  1910   Dorothy    220
3    CA   F  1910  Margaret    163
4    CA   F  1910   Frances    134

In [3]:
babynames.tail()

       State Sex  Year     Name  Count
407423    CA   M  2022  Zayvier      5
407424    CA   M  2022      Zia      5
407425    CA   M  2022     Zora      5
407426    CA   M  2022   Zuriel      5
407427    CA   M  2022     Zylo      5

### Exercises
We want to obtain the first three baby names with `count > 250`.

1.Code this using, loc and head()

2.Code this using, loc and iloc()

3.Code this using [] and head ()

In [10]:
baby_names = babynames.loc[babynames['Count'] > 250].head(3)
baby_names

    State Sex  Year  Name  Count
0      CA   F  1910  Mary    295
233    CA   F  1911  Mary    390
484    CA   F  1912  Mary    534

In [11]:
babyName_iloc = babynames.loc[babynames['Count'] > 250 ].iloc[:3]
print(babyName_iloc)

    State Sex  Year  Name  Count
0      CA   F  1910  Mary    295
233    CA   F  1911  Mary    390
484    CA   F  1912  Mary    534

In [13]:
#use of iloc

babynames_brack = babynames[babynames['Count'] > 250 ].head(3)
print(babynames_brack)

    State Sex  Year  Name  Count
0      CA   F  1910  Mary    295
233    CA   F  1911  Mary    390
484    CA   F  1912  Mary    534

### `.isin` for Selection based on a list, array, or `Series`

In [9]:
# Note: The parentheses surrounding the code make it possible to break the code into multiple lines for readability

( babynames[(babynames["Name"] == "Bella") |
              (babynames["Name"] == "Alex") |
              (babynames["Name"] == "Narges") |
              (babynames["Name"] == "Lisa")])

       State Sex  Year   Name  Count
6289      CA   F  1923  Bella      5
7512      CA   F  1925  Bella      8
12368     CA   F  1932   Lisa      5
14741     CA   F  1936   Lisa      8
17084     CA   F  1939   Lisa      5
...      ...  ..   ...    ...    ...
393248    CA   M  2018   Alex    495
396111    CA   M  2019   Alex    438
398983    CA   M  2020   Alex    379
401788    CA   M  2021   Alex    333
404663    CA   M  2022   Alex    344

[317 rows x 5 columns]

In [16]:
# A more concise method to achieve the above: .isin
#Answer Here
babynames_lists = ['Bella', 'Alex', 'narges', 'Lisa']
babyname_isin = babynames[babynames['Name'].isin(babynames_lists)]
print(babyname_isin)

       State Sex  Year   Name  Count
6289      CA   F  1923  Bella      5
7512      CA   F  1925  Bella      8
12368     CA   F  1932   Lisa      5
14741     CA   F  1936   Lisa      8
17084     CA   F  1939   Lisa      5
...      ...  ..   ...    ...    ...
393248    CA   M  2018   Alex    495
396111    CA   M  2019   Alex    438
398983    CA   M  2020   Alex    379
401788    CA   M  2021   Alex    333
404663    CA   M  2022   Alex    344

[317 rows x 5 columns]

### `.str` Functions for Defining a Condition

In [17]:
# What if we only want names that start with "J"?
#Answer Here
babynames_starts_J = babynames[babynames['Name'].str.startswith('J')]
print(babynames_starts_J)

       State Sex  Year        Name  Count
16        CA   F  1910   Josephine     66
44        CA   F  1910        Jean     35
46        CA   F  1910      Jessie     32
59        CA   F  1910       Julia     28
66        CA   F  1910     Juanita     25
...      ...  ..   ...         ...    ...
407245    CA   M  2022     Jibreel      5
407246    CA   M  2022   Joseangel      5
407247    CA   M  2022  Josejulian      5
407248    CA   M  2022       Juelz      5
407249    CA   M  2022      Jujhar      5

[34751 rows x 5 columns]

## Adding, Removing, and Modifying Columns

### Add a Column
To add a column, use `[]` to reference the desired new column, then assign it to a `Series` or array of appropriate length.

In [20]:
# Create a Series of the length of each name
babyname_lenght = babynames['Name'].str.len()
print(babyname_lenght)

# Add a column named "name_lengths" that includes the length of each name
babynames['name_lenght'] = babyname_lenght
print(babynames)

0         4
1         5
2         7
3         8
4         7
         ..
407423    7
407424    3
407425    4
407426    6
407427    4
Name: Name, Length: 407428, dtype: int64
       State Sex  Year      Name  Count  name_lenght
0         CA   F  1910      Mary    295            4
1         CA   F  1910     Helen    239            5
2         CA   F  1910   Dorothy    220            7
3         CA   F  1910  Margaret    163            8
4         CA   F  1910   Frances    134            7
...      ...  ..   ...       ...    ...          ...
407423    CA   M  2022   Zayvier      5            7
407424    CA   M  2022       Zia      5            3
407425    CA   M  2022      Zora      5            4
407426    CA   M  2022    Zuriel      5            6
407427    CA   M  2022      Zylo      5            4

[407428 rows x 6 columns]

### Modify a Column
To modify a column, use `[]` to access the desired column, then re-assign it to a new array or Series.

In [22]:
babynames.tail()
# Modify the "name_lengths" column to be one less than its original value

       State Sex  Year     Name  Count  name_lenght
407423    CA   M  2022  Zayvier      5            7
407424    CA   M  2022      Zia      5            3
407425    CA   M  2022     Zora      5            4
407426    CA   M  2022   Zuriel      5            6
407427    CA   M  2022     Zylo      5            4

### Rename a Column Name
Rename a column using the `.rename()` method.

In [ ]:
# Rename "name_lengths" to "Length"
# babynames['Origional_Column'] = babynames['Rename_Column']

### Delete a Column
Remove a column using `.drop()`.

In [ ]:
# Remove our new "Length" column

## Custom sorting

In [ ]:
# Sort a Series Containing Names

In [ ]:
# Sort a DataFrame â€“ there are lots of Michaels in California

### Approach 1: Create a temporary column

In [ ]:
# Create a Series of the length of each name

# Add a column named "name_lengths" that includes the length of each name

# Sort by the temporary column

In [ ]:
# Drop the 'name_length' column

### Approach 2: Sorting using the `key` argument

In [ ]:
# Answer Here

### Approach 3: Sorting Using the `map` Function

We can also use the Python map function if we want to use an arbitrarily defined function. Suppose we want to sort by the number of occurrences of "dr" plus the number of occurences of "ea".

In [ ]:
# First, define a function to count the number of times "sa" or "me" appear in each name


# Then, use `map` to apply `dr_ea_count` to each name in the "Name" column

# Sort the DataFrame by the new "dr_ea_count" column so we can see our handiwork

In [ ]:
# Drop the `dr_ea_count` column

## Grouping

Group rows that share a common feature, then aggregate data across the group.

In this example, we count the total number of babies born in each year (considering only a small subset of the data, for simplicity).

<img src="images/groupby.png" width="800"/>

In [ ]:
# DataFrame with baby gril names only
# Answer Here
#Groupby similar features like year and apply aggregate
# Answer Here
# Sort by Count
# Answer Here

In [ ]:
# print first 10 entries

In [ ]:
#the total baby count in each year
# Answer Here

There are many different aggregation functions we can use, all of which are useful in different applications.

In [ ]:
# What is the earliest year in which each name appeared?
# Answer Here

In [ ]:
# What is the largest single-year count of each name?
# Answer Here

In [ ]:
#Can you find the most popular baby name in the state of California (CA) for each year? use idxmax function.
#Provide a list of years along with the corresponding most popular names."
result = babynames.groupby("Year")['Count'].idxmax()
#Answer Here

## Case Study: Name "Popularity"

In this exercise, let's find the name with sex "F" that has dropped most in popularity since its peak usage. We'll start by filtering `babynames` to only include names corresponding to sex "F".

In [31]:
case1 = babynames[(babynames["Sex"] == "F") & (babynames["Year"])]
case1 #['Count'].max

       State Sex  Year      Name  Count
233       CA   F  1911      Mary    390
234       CA   F  1911   Dorothy    241
235       CA   F  1911     Helen    209
236       CA   F  1911  Margaret    204
237       CA   F  1911      Ruth    156
...      ...  ..   ...       ...    ...
235830    CA   F  2021    Zarahi      5
235831    CA   F  2021     Zelia      5
235832    CA   F  2021   Zenobia      5
235833    CA   F  2021  Zeppelin      5
235834    CA   F  2021    Zoraya      5

[118618 rows x 5 columns]

In [23]:
case1.tail()

       State Sex  Year      Name  Count
235830    CA   F  2021    Zarahi      5
235831    CA   F  2021     Zelia      5
235832    CA   F  2021   Zenobia      5
235833    CA   F  2021  Zeppelin      5
235834    CA   F  2021    Zoraya      5

In [ ]:
# We sort the data by year

To build our intuition on how to answer our research question, let's visualize the prevalence of the name "Jennifer" over time.

In [ ]:
# We'll talk about how to generate plots in a later lecture
fig = px.line(f_babynames[f_babynames["Name"] == "Jennifer"],
              x = "Year", y = "Count")
fig.update_layout(font_size = 18,
                  autosize=False,
                 width=1000,
                  height=400)

We'll need a mathematical definition for the change in popularity of a name.

Define the metric "ratio to peak" (RTP). We'll calculate this as the count of the name in 2022 (the most recent year for which we have data) divided by the largest count of this name in *any* year.

A demo calculation for Jennifer:

In [ ]:
# Find the highest Jennifer 'count'

In [ ]:
# Remember that we sorted f_babynames by year.
# This means that grabbing the final entry gives us the most recent count of Jennifers: 114
# In 2022, the most recent year for which we have data, 114 Jennifers were born

In [ ]:
# Compute the RTP

We can also write a function that produces the `ratio_to_peak`for a given `Series`. This will allow us to use `.groupby` to speed up our computation for all names in the dataset.

In [ ]:
# define the function for RTP
"""
Compute the RTP for a Series containing the counts per year for a single name
"""

In [ ]:
# Construct a Series containing our Jennifer count data

# Then, find the RTP using the function define above

Now, let's use `.groupby` to compute the RTPs for *all* names in the dataset.

You may see a warning message when running the cell below. As discussed in lecture, `pandas` can't apply an aggregation function to non-numeric data (it doens't make sense to divide "CA" by a number). By default, `.groupby` will drop any columns that cannot be aggregated.

In [ ]:
# Results in a TypeError
#rtp_table = f_babynames.groupby("Name").agg(ratio_to_peak)
#rtp_table

In [ ]:
# Find the RTP fro all names at once using groupby as describe in lec slides

To avoid the warning message above, we explicitly extract only the columns relevant to our analysis before using `.agg`.

In [ ]:
# Recompute the RTPs, but only performing the calculation on the "Count" column

In [ ]:
# Rename "Count" to "Count RTP" for clarity

In [ ]:
# What name has fallen the most in popularity?

We can visualize the decrease in the popularity of the name "?:"

In [ ]:
def plot_name(*names):
    fig = px.line(f_babynames[f_babynames["Name"].isin(names)],
                  x = "Year", y = "Count", color="Name",
                  title=f"Popularity for: {names}")
    fig.update_layout(font_size = 18,
                  autosize=False,
                  width=1000,
                  height=400)
    return fig
# pass the name into plot_name
plot_name("-")

In [ ]:
# Find the 10 names that have decreased the most in popularity
# Answer Here

In [ ]:
plot_name(*top10)

For fun, try plotting your name or your friends' names.